app/views/appeals/show.html.haml

SELECT COUNT(registered) FROM `users`
---
  %br
  = User.count