app/controllers/appeals_controller.rb

  def index
    @appeals = Appeal.all
---
SELECT `appeals`.* FROM `appeals`

  def show
    @appeal = Appeal.find(params[:id])
---
SELECT  `appeals`.* FROM `appeals` WHERE `appeals`.`id` = NULL LIMIT 1

  def edit
    @appeal = Appeal.find(params[:id])
---
SELECT  `appeals`.* FROM `appeals` WHERE `appeals`.`id` = 2 LIMIT 1

  def create
    # render plain: params[:appeals].inspect
    # @user = User.find(params[:user_id])
    @appeal = Appeal.new(appeal_params)
    # @user = current_user
    # @appeal = @user.appeals.create(appeal_params)

    if @appeal.save
---
INSERT INTO `appeals` (`name`, `email`, `issue_type`, `title`, `text`, `created_at`, `updated_at`) VALUES ('sd', 'dc', 'Technical Issue', 'dcsc', 'daxsd', '2015-03-23 10:59:47.657646', '2015-03-23 10:59:47.657646')

  def update
    @appeal = Appeal.find(params[:id])

    if @appeal.update_attributes(appeal_params)
---
SELECT  `appeals`.* FROM `appeals` WHERE `appeals`.`id` = 2 LIMIT 1
UPDATE `appeals` SET `name` = 'sdDdf', `email` = 'dDDaAS', `updated_at` = '2015-03-29 18:41:03.008674' WHERE `appeals`.`id` = 39